[
    {
        "url": "https://ca.indeed.com/viewjob?jk=5788cf443b5b5209",
        "title": "Team Lead, Software Development",
        "company": "Dealer-FX Group",
        "content": "\n Overview: \n Who We Are\n\n\n Since 2007, Dealer-FX has transformed how automotive retailers manage their service operations and interact with consumers. Through advanced data integrations and mobile technology, Dealer-FX streamlines processes and communication for automotive service departments while delivering convenience, transparency, and trust to consumers. Dealer-FX is a wholly owned subsidiary of Snap-on Incorporated (NYSE: SNA), which acquired Dealer-FX in 2021.\n \n\n\n Dealer-FX has been serving automotive OEMs and dealerships for almost a decade. Dealer-FX is transforming how millions of consumers interact with automotive brands and their retailers. Our platform uses advanced data analysis and mobile applications to deliver convenience, transparency, and trust to consumers and increase efficiency, profitability, retention, and brand loyalty to OEMs and dealers.\n \n\n What we are looking for\n\n\n At Dealer-FX, we put our users first. The automotive landscape and world are constantly changing, so we need Development Team Leads who are continuously adapting and excited to work on products that affect thousands of people daily.\n \n\n\n In this role, you will work closely with the senior technical and management teams to design new solutions, as well as identify areas of improvement for our existing products. You will lead a team of developers in an agile environment to ensure that these new and current products are delivered on time, and with quality.\n  Responsibilities: \n \nProvide technical and team leadership through coaching and mentoring to a team of software developers\n Maintain high standards of code quality by adhering to established best practices and processes\n Identify areas for improvement within the team, and establish plans for their improvement\n Collaborate with other team leads to ensure consistency in development best practices, and share opportunities for improvement\n Collaborate closely with the architecture team to understand the target architecture, and ensure that implementation follows that architecture\n Contribute to the full development cycle, including design, development, unit testing and code reviews.\n Identify risks and mitigation strategies throughout the development cycle.\n Collaborate with the product management team to understand requirements, and facilitate communication of these requirements to the development team members.\n Collaborate with the devops team to ensure the completed development work is deployed to the production environments efficiently.\n Work with senior management to provide high level estimates on long-term roadmap initiatives\n Assist the DevOps/support teams in various activities, such as troubleshooting high priority implementation issues, production investigations, etc.\n\n\n Qualifications: \n \n5+ years of software development experience\n 2+ years of experience leading development teams\n Experience with .NET Framework, .NET Core, ASP.NET Core, MVC, Entity Framework, and RabbitMQ\n Framework/Library experience (Angular or similar, e.g., Vue.js, React)\n Experience with HTML, JavaScript, CSS\n Experience with.Net WebAPI, RESTful APIs development\n Experience with C# and Async technologies\n Experience with AWS technologies (e.g., Lambda, EC2, S3, DynamoDB, API Gateway, CloudWatch)\n Experience with Microservices/ Terraform / CI/CD Pipeline\n Experience with SOAP services integration\n Experience using service-oriented architecture (SOA) and Web Service Development\n Experience with MS SQL Server, Database structures and design\n Excellent verbal, written and interpersonal communication skills\n Strong problem-solving skills\n Experience working with agile scrum methodology\n\n\n Preferred qualifications:\n\n Any experience in building Web components will be a big plus\n\n\n What’s in it for you?\n\n\n Vast opportunities for growth\n Competitive compensation packages\n A flexible work schedule for work-life balance\n Comprehensive Training and Development support\n Group health and dental benefits\n Employee Assistance Program\n 3 weeks of paid vacation\n Cool company events and team building\n\n\n Dealer-FX is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability or any other characteristic protected by law. Accommodation is available upon request for applicants with disabilities.\n\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=7bdf639de5fecf7f",
        "title": "Full Stack Developer",
        "company": "Actalent",
        "content": "Equivalent Experience \n\n\nDescription:\nPosition Summary: We’re looking for developers who are happy optimising an index, poking a message queue and shifting everything left by 4 pixels. Having the confidence to jump projects and write some low-level network code too is a plus. The team is a group of dedicated individuals who utilize cryptographic algorithms and integrate them into internet protocols – you might be mentoring us with your skills at dealing with web-scale data. Team members are responsible for implementation and testing, with a heavy emphasis on security, efficiency, resiliency, and high performance. Our implementations are for a variety of desktop, mobile and embedded platforms. Responsibilities: • Create demonstrations of our tools to showcase to customers • Create tools to test our code for correctness, security and performance\nSkills:\nangular, javascript, c, java, vue.js, graphql, node, mariadb, full stack development, sql database, oracle, queries, react, docker, cryptography\nTop Skills Details:\nangular,javascript,c,java,vue.js,graphql,node,mariadb,full stack development,sql database,oracle,queries\nAdditional Skills & Qualifications:\nMUST HAVE's: 1) Have a degree in Computer Engineering, Computer Science, Electrical Engineering, Mathematics or no degree with solid programming experience (Javascript (ideally) mainly right now, OR C) Mainly focused on the back-end of the stack. 75-90% back-end work in this role. 2) 3+ years experience with SQL databases is key, but they really want developers who aren’t afraid to conquer and suggest new languages or technologies if a problem elsewhere pops up. They're currently using Postgres so that one would be ideal for quicker familiarity with their current codebase, but as long as they’re reasonably experienced with any of the major ones, e.g. MariaDB, SQL Server or Oracle (possibly even DB/2, but that one’s rare), jumping to another should not be a huge hurdle. Have they worked with the database directly rather than through a framework. Writing Queries by hand 3) 3+ years experience with Node.JS in an Enterprise setting 4) Ability to dissect a problem and form solutions that meet real-time constraints, especially when faced with enterprise-scale datasets. NICE TO HAVE's: 1) Experience with Docker is a plus. 2) Experience with React is a plus (it would give the person insight of how the back-end works) 3) Experience with cryptography is a plus. 4) Big data platforms (tools: Apache Hudi or Google’s BigQuery)\nExperience Level:\nIntermediate Level\n \n\nÀ propos d'Actalent:\nActalent relie la passion à la mission. Nos solutions de candidats talentueux et la performance de nos services produisent la valeur et les résultats, tout en apportant la compétence qui permet à nos clients de réaliser plus. Nos experts situés dans le monde entier inspirent au quotidien. Nous soutenons les initiatives essentielles en ingénierie et en sciences, par les expériences qui favorisent un développement continu. La différence, c’est nos gens. Actalent est une société d’exploitation d’Allegis Group, leader mondial des solutions de candidats talentueux. \nL’entreprise souscrit au principe d’égalité d’accès à l’emploi et prendra en compte toutes les candidatures sans distinction de race, sexe, âge, couleur, religion, nationalité, statut de vétéran, handicap, orientation sexuelle, identité sexuelle, information génétique ou toute autre distinction protégée par la loi. \nAbout Actalent:\nActalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions.\n The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=19cdb6f9fe847121",
        "title": "Software Developer (JavaScript)",
        "company": "Axonify",
        "content": "Axonify is an intelligent workforce enablement solution that supports 3.5M frontline workers. We believe all frontline employees should be empowered with the tools, knowledge and support to be inspired to do great work every day.\nWe offer a bite-sized learning experience, gamified training & reinforcement and a two-way, real-time communication solution, all in a personalized experience that fits seamlessly into the flow of work.\nThe Javascript Developer will be part of our frontend team and will help us create new features and products, as well as maintain existing User Interfaces. You will collaborate with other developers, Designers, QAs and Product Managers to help craft the best user experience possible and shape the direction of our products.The things you’ll do:\n\nWork collaboratively with the entire development team to implement, test and maintain current and new product features\nUse HTML5 technologies (HTML, CSS, JavaScript ES2015 etc.) in a cross-browser and cross-platform environment (mobile and desktop)\nBecome knowledgeable with existing architecture and processes\nHelp architect solutions based on requirements, designs, and user stories from the Product Management team\nHandle multiple tasks and prioritize them appropriately\nDesign test cases and implement unit tests\nWork with the Quality Assurance team to assist in the implementation and maintenance of interface tests\nAnd of course, other duties to support Axonify and further build your skills\n\nThe things you bring:\n\nProfessional Experience. 3+ years of experience with HTML5 technologies (HTML, CSS, JavaScript ES2015 etc.) in a cross-browser and cross-platform environment (mobile and desktop).\nKnowledge. Excellent understanding of common JavaScript design patterns and OO designs within RESTful single page apps.\nQuality Mindset. You are motivated by delivering quality work, are detail-oriented and good at juggling priorities.\nEnthusiasm. You are a highly enthusiastic team player, with a positive attitude.\nCollaboration. Strong collaboration skills to effectively complete cross-functional goals and projects.\nBrownie points for experience with Backbone, React and/or TypeScript\n\nWork location:\nYou will have the flexibility to choose how you work - in office, virtually or a combination of both. You will be provided with the tools, resources and support to ensure success regardless of where you physically work.\n*The things you’ll enjoy:*\n*An impactful product* that gives back to the communities and frontline workers that support our everyday lives.People with great attitudes that lead to great results through our values of Collaborate, Be Bold and Get It Done.A diverse Axonify Community That celebrates unique perspectives and experiences that add richness to our culture.Leaders that trust deeply who leverage our skills, adapt to us as individuals and encourage us to be our best selves.Flexibility and choice. Early riser? Great, we offer flexible work hours. Prefer to work from home and in the office? No problem, we operate on a hybrid model where you work in the location that supports your personal and professional life. East or West coast? We have employees that span across Canada, the US and the UK. Eid or Christmas? Our Flexible Holiday Program supports you to take the days off that matter to you.Professional growth. We’re learning experts and our excitement goes beyond our product. Not only do we offer Axonifiers daily learning, continual growth and broad experiences, we also offer a Professional Growth Spending account to encourage more development even outside of work hours.Wellbeing that supports our lives away from work. We love what we do, but we also love our lives away from Axonify and we encourage employees to enjoy their personal lives with generous vacation time, Axonify holidays, personal days, competitive benefits with a Wellness Spending Account, and in-house workshops such as yoga, financial planning or mental wellbeing and self-care.\n*Ready to join the team? Here’s what’s next.*\nWe know that what you bring may not look exactly like what we have listed here. And that’s ok if you don’t check every box! If you check off more than a few - great! We’d welcome a chance to get to know what you can bring, how you can add to our culture, and hear your unique story.\nApply. Our Talent Acquisition team reviews every resume and cover letter submitted and are committed to providing an outstanding experience throughout your journey with us. Learn more about our candidate experience by visiting us at www.axonify.com/careers.\nWe believe our team’s unique life experiences, backgrounds, cultures, beliefs and abilities add richness to our culture and depth to our ideas. Our ongoing commitment to diversity and inclusion creates an environment that supports, empowers and delivers a sense of belonging for all members of Axonify. And while the journey is continuous&mdash;always learning and adapting&mdash;we know that when we help each other grow, we can achieve amazing things together.\nWe want to remove barriers that may limit you from joining Axonify. Email us at accessibility@axonify.com to let us know how we can provide you with reasonable accommodations through our candidate journey.\nJob Type: Full-time"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=a82670b98bb114ff",
        "title": "Software Developer in Test and Automation",
        "company": "RideCo",
        "content": "\nRole Summary:\n This is an opportunity in the exciting and fast-growing transportation technology industry, with a software company that has been growing sales at 100%+ annually over the past several years. RideCo is directly improving people's lives by solving urban mobility challenges that we can all relate to. We are experiencing explosive growth as people are returning to public transit and transit agencies are turning to our proven on-demand microtransit platform to provide better transit service for less cost.\n As a member of the Test & Automation Team, you will be responsible for ensuring RideCo's on-demand transit platform is always running smoothly and meeting our customers' needs. The ideal candidate will have a deep interest in building cloud-based software that can operate at a large scale, solving computationally intensive NP-hard problems, with real-time responsiveness, all while maintaining 99.99% up-time.\n Members of the Test & Automation Team work cross-functionally within our Engineering organization, being part developer, part tester, and wearing whatever hat is needed at any given time. You need to be an excellent communicator and thrive in a small-team environment with fast-paced agile iterations. Your contributions will deliver meaningful impact to our customers and the company.\n Your day-to-day responsibilities will include:\n\nCollaborate with engineers, product owners, project stakeholders, and other RideCo staff to determine requirements, investigate bugs, implement test cases, and report on test results\nWork with engineers to develop test automation strategies and frameworks\nBuild, maintain, and enhance tools that streamline and automate all forms of testing\nBuild and run automated functional, integration, stress, and performance tests\nRun large scale simulations based on custom or real-world data to find or reproduce issues, bottlenecks, and regressions\nAnalyze and report the results of testing efforts in a clear and timely manner\nManual testing of mobile, web, and back-end applications, as necessary\n\nYour playground / what you’ll learn:\n At RideCo you’ll get a chance to play, learn, and build with the following tools and technologies, and as part of a cross-functional team that is the world’s foremost innovator in on-demand transit software.\n\nLanguages: Python, Bash script, JavaScript / Angular\nWeb Stack: Django, Flask, Gunicorn, Nginx\nMobile: Ionic, hybrid apps for Android and iOS\nLogistics Engine: algorithms for real-time vehicle routing, optimization, dynamic partitioning, NP-hard problems\nMapping/Routing: OpenStreetMap, travel time/route estimation, traffic modeling\nInfrastructure: AWS, Redis, PostgreSQL, RabbitMQ / Dramatiq, Docker\nHealth/Monitoring: AWS CloudWatch, Prometheus, Grafana, Elasticsearch, Logstash, Kibana\nDevelopment Processes: Agile, continuous integration, Jenkins, zero-downtime software updates\n\nPreferred Qualifications and Experience:\n\nExcellent communication skills\n2 or more years of experience in at least three of the technologies mentioned in the previous section\nDegree in Computer Science, Software Engineering, or a related discipline\nExperience as a Software Developer or QA Engineer\nKnowledge of testing mobile, web, and client/server applications\nExperience in automation and automated testing, including functional, integration, stress, and performance\nScripting and experience building diverse, robust tooling (Python, Perl, Shell)\nAnalytical, troubleshooting, and problem-solving skills\n\nCompensation and Benefits:\n\nBase salary: $70K - $100K + performance-based bonus + stock options\nWork-Life Balance & Additional Perks: Flex-time work schedules, vacation time, catered lunches, social events, casual dress code\nBenefits Plan: Medical, dental, prescription, life/health spending accounts and more\nWork Environment: Located in KW's most desirable work space in the heart of Uptown Waterloo\nCommuter Program: Complimentary rides to and from work\n\nWho we are: http://www.rideco.com\n RideCo powers on-demand transit. Public transit agencies use RideCo's cloud-based software platform to provide on-demand shared rides in dynamically routed buses, vans, and cars. Our clients include some of the world’s largest transportation operators such as San Antonio Metro, Los Angeles Metro, San Diego County and Calgary Transit.\n Have you experienced getting frustrated with transfers and waiting while taking a public bus? Have you seen buses drive around in low-density areas with very few passengers on-board and wondered how inefficient that seems to be? You're likely aware of the first & last mile access challenges faced by transit hubs. We are solving these problems by re-imagining shared mobility. Imagine a world where vehicles have dynamic routes responsive to real-time trip demand. This 'dynamic shuttle' (or van /sedan) would pick you up, on-demand, at or near your doorstep and take you to your destination or transit hub. Along the way, it may pick-up other passengers going in your direction. Your experience will be seamless: less waiting, less walking, fewer transfers, shorter travel time, and timely pickups and drop-offs. RideCo's 'dynamic shuttle' platform enables this seamless experience and low-cost shared rides for vehicle fleet operators and their passengers. By seamlessly moving more people in fewer vehicles we are catalyzing a generational shift in how people get around cities and towns. This means commuters spend less time in transit and more time doing what they enjoy.\n RideCo powers a diverse range of use cases, including residential/ suburban travel; first-mile-last-mile connections for transit hubs; and corporate employee transportation. We are investing to scale up and capture the growing demand for on-demand shared rides solutions.\n\n RideCo is proud to be an equal opportunity employer, we are committed to building and supporting a culture of diversity, inclusion, and accessibility. We hire the best talent regardless of race, color, creed, national origin, ancestry, disability, marital status, age, veteran status, sex, sexual orientation, gender identity, and expression. Building a team that represents a variety of backgrounds, perspectives, and skills benefits our employees, our customers, our products, and our community.\n In accordance with the Accessibility for Ontarians with Disabilities Act, accommodations are available upon request for candidates taking part in all aspects of the selection process. If you require special accommodation to complete any portion of the application or interview process, please contact people@rideco.com.\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=7e0e545421961e05",
        "title": "Full Stack Software Developer",
        "company": "Coeus h3c",
        "content": "Software Engineer Full Stack\nAbout coeus h3cWe believe healthcare is a fundamental human right and, in today’s world where the center of care is moving to the home, there’s no reason why continuous Patient Monitoring and Care can’t be delivered at scale without friction\nMarket BackgroundFor the past decade, the need for home care has grown significantly. Advancements in consumer medical device IOT technology, remote patient monitoring (RPM) and tele-medicine combined with a significant aging population, hospital resource shortages and high costs have fueled the demand for virtual health care. Virtual care, also known as remote care, enables providers to monitor and treat patients away from the traditional care setting of hospitals and physician clinics into the comfort of their homes. This model promises to increase access to healthcare, while decreasing costs and increasing positive outcomes for the patient.\nMarket ChallengeThis increase in demand has revealed significant operational complexities, highlighting the friction of managing device logistics, technical support, device reliability and ensuring the effectiveness of home healthcare programs. Worse, the burden to solve this friction was placed on healthcare providers, RPM vendors and the patient’s family and friends. Today, getting devices assembled, distributed to the home, installed, and configured within the time required is critical to the successful care of the patient.\nWhat we’re doing about ith3c is the world’s first web-scale virtual care engagement technology platform dedicated to enabling the seamless delivery, installation, integration and support of consumer class medical devices into the patient’s home. h3c automates the technology and logistics tangle that impedes the success of today’s remote patient monitoring solutions, delivering an easy, frictionless experience that supports improved patient adherence, and engagement and caregiver satisfaction\nAbout our engineering teamWe are a high energy outcomes driven team. We are responsible for the full stack of our cloud infrastructure and applications that support the real time management of devices. This team is ideal for a highly motivated individual who is passionate about health care and delivering impactful solutions to the consumer market. This position works directly with senior staff and provides the opportunity to create meaningful and significant impact to our software solutions.\nPosition: Software Engineer Full StackWe are seeking an experienced and motivated software developer to join our h3c engineering team. In this role, you will work closely with product management and senior leadership to deliver against the product roadmap for our virtual care engagement platform.\nKey Responsibilities:\n\nResearch and become the market expert for digital health devices and delivery covering the United States, Europe and Canada.\nDeliver high-quality work. You will be a key contributor in the successful completion of major initiatives for our solutions that directly impacts patient care, satisfaction and adoption..\nUnderstand organizational needs, and build and deploy infrastructure for data storage, production web systems, mobile applications, and consumer device telemetry.\nCreate and review designs and systems to ensure and support good operational practices (e.g. reliability, monitoring, alerting, etc.).\nDesign & develop full stack applications for web-scale use across multiple form factors from mobile to desktop.\n\nQualifications:\n\nMission-driven and passionate about building technology that will directly improve caregiver and patient lives\nBachelors of Computer Science degree or a related field\n2+ years of professional software development experience with exposure to best practices and a track record of delivering in a team environment\nSoftware development experience under a Quality Management System, ideally with exposure to ISO 13485 and regulated medical devices\nDemonstrate fluency in a modern programming language and systems concepts. Experience with Java, JavaScript (Angular, Bootstrap, jQuery)\nDevOps experience with AWS cloud services or equivalent is an asset.\n\nJob Type: Full-time\nSalary: $85,000.00-$105,000.00 per year\nBenefits:\n\nCasual dress\nDental care\nEmployee assistance program\nExtended health care\nLife insurance\nOn-site parking\nPaid time off\nVision care\n\nSchedule:\n\n8 hour shift\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nWaterloo, ON: reliably commute or plan to relocate before starting work (required)\n\nWork Location: Hybrid remote in Waterloo, ON"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=c39b0ee23120bc39",
        "title": "Software Developer",
        "company": "Logisense",
        "content": "\n\nDescription\n LogiSense is seeking a Software Developer to join our team and work on fascinating technology, while enjoying a work-from-home virtual environment with an outstanding group of people who are solving new challenges around monetizing IoT, Communications and XaaS products and services for Enterprise customers. As a key member of our Engineering team, you’ll help us build and enhance our industry-leading usage-based billing platform that offers companies a new way to do business.\n LogiSense believes that people should pay for what they use, that billing should be clear and accurate, and that companies should treat customers with foresight and respect. The technology needed to do that—to measure, rate, and bill for every instance, event, or action—is complex and always changing. Our billing technology can rate and monetize any product or service.\n LogiSense values work-life balance, seeks people of high integrity and talent and offers excellent benefits and pay along with company funded opportunities for personal development, training and certification - not to mention company hackathons, social events and other company-sponsored activities to enable team innovation and individual professional development.\n The position\n As a LogiSense Software Developer you’ll gain expertise working with a team of professional software developers building new features for the platform. Your area of focus will be primarily around backend services and API development.\n At LogiSense, our core values are: Be good. Seek balance. Get paid. Every decision we make aligns to these principles. In this role, you will…\n\n Be Good At:\n\n\n\n      Applying your formal experience: minimum 4 years of professional web development; and a post-secondary education in Computer Science, Software Engineering or equivalent\n    \n\n\n      Demonstrating your solid experience delivering scalable enterprise web applications with .NET, C# and Visual Studio\n    \n\n\n      Demonstrating your experience developing cloud native software utilizing relational databases\n    \n\n\n      Demonstrating your experience with debugging, performance profiling, and optimization\n    \n\n\n      Developing a broad understanding of the entire LogiSense Billing platform architecture\n    \n\n\n      Developing a deep functional and technical understanding of multiple LogiSense Billing platform components\n    \n\n\n      Displaying your solid understanding of both logical and physical web architecture best practices, and of object-oriented and service-oriented application design and architecture\n    \n\n\n      Taking end-to-end responsibility for delivering new platform features and functionality\n    \n\n\n      Providing effort estimates for product roadmap deliverables\n    \n\n\n      Decomposing high level requirements into development tasks, work items and milestone deliverables\n    \n\n\n      Implementing and deploying working software in an iterative manner\n    \n\n\n      Working closely with product owner(s) and team lead(s) to ensure delivery meets user requirements\n    \n\n\n      Communicating technical decisions and direction through design docs and feature walkthroughs\n    \n\n\n      Facilitating design reviews that ensure a balanced approach to both technical and business requirements\n    \n\n\n      Consulting with QA to develop comprehensive test plans and test automation strategies\n    \n\n\n      Consulting with IT and Support to develop comprehensive deployment, upgrade and monitoring plans\n    \n\n\n      Staying abreast of leading edge software delivery techniques, technologies and toolsets\n    \n\n\n      Driving technical standards, adopting best practices, and supporting a culture of continuous improvement\n    \n\n\n      Proactively identify and communicate areas of strategic technical debt with plans to address\n    \n\n\n      Practicing strong code and configuration management techniques\n    \n\n\n      Using sound judgement to make well-reasoned decisions and tradeoffs when necessary\n    \n\n\n      Contributing wherever you can to help the team meet its commitments\n    \n\n\n      Supporting the tools and products that the team delivers\n    \n\n\n      Learning, teaching, communicating, and collaborating every day using your strong written and verbal communication skills\n    \n\n\n      Having the ability to organize, prioritize, and work independently with minimal supervision\n    \n\n\n      Having the ability to collaborate effectively with other teams and team members, and to receive constructive feedback on a regular basis\n    \n\n\n      Developing your own unique areas of expertise and applying them in a way that contributes to team success\n    \n\n\n      Bonus points for familiarity with:\n    \n\n\n\n        JSON\n      \n\n\n        SQL Server and/or PostgreSQL\n      \n\n\n        Linux\n      \n\n\n        Docker\n      \n\n\n        NoSQL databases\n      \n\n\n        TDD\n      \n\n\n        Amazon Web Services\n      \n\n\n        Scrum and/or Kanban\n      \n\n\n        IP technology including Billing, VoIP, Wireless, Hosted Communications, IoT\n      \n\n\n\n Seek Balance Through:\n\n\n\n      The option to work how you choose: LogiSense is committed to letting our staff work fully remote, in office, or using a hybrid model of their choosing\n    \n\n\n      A healthy work-life balance, enjoying paid time off and holidays, and also taking advantage of time and funding provided by LogiSense to develop your skills and education\n    \n An enthusiasm to work both individually and collaboratively in a team environment\n\n\n Get Paid:\n\n\n\n      A highly competitive salary, comparable to or above industry standard\n    \n\n\n      Through perks of life at LogiSense that include autonomy and virtual work flexibility, comprehensive benefits (optical, dental, pharmaceutical and others), paid vacation, and company holiday shutdown in addition to numerous other events, perks, swag and accoutrements of the LogiSense culture\n    \n Via stock options and equity on a discretionary basis for long-term high performers dedicated to the success of the company\n\n\n\n You do more than check boxes…\n\n\n    We’re not just looking for a list of qualifications — we’re looking for the right person for the job. We take pride in creating a great culture with autonomy, flexibility and world-class pay and benefits. In return, we are seeking intelligent, curious and driven individuals who see things the way we do.\n  \n We’re looking for a Software Developer who wants to grow their career and take an active role in improving our product and our company.\n Your ideas matter. Your work matters. You matter. Come join our team!\n LogiSense is an equal opportunity employer and we are proud to provide any necessary accommodation during the recruitment and employment process. Should you require any accommodation, please indicate this when you apply and we will work with you to meet your accessibility needs.\n\n\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=1d01620bc14f7247",
        "title": "Software Developer - Performance",
        "company": "McAfee, LLC",
        "content": "\n\n\n\nRole Overview:\n\n Do you want to test and ensure performance of a product used by 45M+ worldwide users? We’re a tight-knit team working together on performance and power testing to ensure that our main product works seamlessly at all times so that 45M people stay safe online.\n  \n The Software Developer – Performance position works within the Power and Performance (PnP) team which is responsible for performance testing of our flagship Windows products. The PnP team is working with the latest versions of the McAfee products and testing them in all possible environments for systems performance responses.\n  \n We develop testing procedures using bleeding edge and experimental coding techniques. For testing, we use a custom, in-house developed testing framework. As the market technology and the performance requirements change, our team predicts and constantly adapts to develop new tests to stay on top and support our clients with the best Antivirus and security needs.\n  \n The Software Developer – Performance position is hybrid: 2-3 days per week remote and onsite in our Waterloo office (Research-in-Motion Park/Univ of Waterloo area) (Kitchener, Cambridge, Hamilton, Guelph) because our testing equipment is in the Waterloo office and our partners require that the performance testing be done onsite.\n  \n The PnP team is working with the latest versions of the McAfee products and testing them in all possible environments for systems performance responses. \n   We are developing testing procedures using bleeding edge and experimental coding techniques. For testing, we use a custom, in-house developed testing framework. As the market technology and the performance requirements change, our team predicts and constantly adapts to develop new tests to stay on top and support our clients with the best Antivirus and security needs.\n   About the role:\n\n Performance & power testing of McAfee’s main product\n Develop and debug complex software with a client-server architecture in C# and scripting languages (Python, PowerShell)\n Develop and debug reporting tools using web technologies\n Work with management to determine product testing requirements and tools\n Provide guidance on resolving performance issues\n All testing systems are proprietary; we do lots of experimental code.\n\n\n About You:\n\n At least 3 years of object-orientated application development using C#\n Experience with JavaScript, HTML/CSS and frameworks such as AngularJS or ReactJS\n Experience working with client-server architectures\n Proficient in Object-oriented Programming Concepts\n Solid knowledge of code assessment and debugging skills\n Software development process, optimization techniques, and testing methodologies\n Experience working with Windows hardware and networking is a bonus\n Experience with Power and Performance Analysis is a bonus\n Other scripting languages, Python, PowerShell are a bonus\n Experience with database/SQL is a bonus\n\n\n #LI-Remote\n\n Company Overview\n\n\n McAfee is a leader in personal security for consumers. Focused on protecting people, not just devices, McAfee consumer solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protects their families and communities with the right security at the right moment.\n\n\n Company Benefits and Perks:\n\n\n We work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.\n\n Bonus Program\n Pension and Retirement Plans\n Medical, Dental and Vision Coverage\n Paid Time Off\n Paid Parental Leave\n Support for Community Involvement\n\n\n We're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.\n\n\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=ca76c7a1a589af2f",
        "title": "Sr. Full Stack Java Developer",
        "company": "CGI",
        "content": "We are Canada's largest independent information technology services firm, and after 40 years, we're still growing! We have a challenging career opportunity for a Sr. FullStack Developer to work for one of our clients. \nInsights you can act on \n\n While technology is at the heart of our clients’ digital transformation, we understand that people are at the heart of business success. \n\n When you join CGI, you become a trusted advisor, collaborating with colleagues and clients to bring forward actionable insights that deliver meaningful and sustainable outcomes. We call our employees “members” because they are CGI shareholders and owners, and, as owners, we enjoy working and growing together to build a company we are proud of. This has been our Dream since 1976, and it has brought us to where we are today—one of the world’s largest independent providers of IT and business consulting services. \n\n At CGI, we recognize the richness that diversity brings. We strive to create a work culture where everyone belongs, and we collaborate with clients in building more inclusive communities. As an equal opportunity employer, we empower all our members to succeed and grow. If you require an accommodation at any point during the recruitment process, please let us know. We will be happy to assist. \n\n Ready to become part of our success story? Join CGI—where your ideas and actions make a difference. \nYour future duties and responsibilities \n\n\nLead delivery teams which develop new custom applications, enhance/modernize existing applications, and provides system integration services\nAssist Project Manager in the planning and estimation of project deliverables\nPlan, direct, and daily coordinate activities with the team members\nContribute to the development of standards and processes\nA technical leader can work in an agile environment that requires adaptation to changing digital transformation needs.\nSupervise the progress of development activities\nPerform code reviews and Support the team in troubleshooting technical issues\nEnforce coding standards and best practices\nAssist project manager with adhering to project deadlines and schedules\nCreate High Level and Detailed Design for the projects\nProvide technical leadership to the team.\nCoach, Mentor, and Train team members in Technology and Process.\nSound knowledge of Agile frameworks like Scrum, Kanban, Lean and xTreme Programming.\n Required qualifications to be successful in this role \n\n\n5+ years of full-stack development\nExperience in design, architecture, Proof of Concept, and Proof of Technology\nExcellent understanding of key concepts of architecture in a distributed environment\nObject-oriented programming, design patterns, performance tuning, Web Services, Micro Services, Responsive Web Design\nSolid experience in technology implementation: Java, Spring ( Spring Boot, Spring MVC ), Hibernate,\n JSP, Servlet, Beans, Angular JS, Angular 6.x, HTML5, CSS3 \n\n\nExperience with development life cycle including:\n o Source control (Subversion, BitBucket, Git, etc.) \no Builds and build delivery ( Jenkins, Maven, Ant, etc.) \no Development of unit tests ( JUnit, TDD, Mockito, etc.) \n\n\nKnowledge of XML , XSLT , XML Schema and JSON\nExperience in developing webpages/websites (Single page application, Progressive Web Applications, Enterprise web applications )\nExperience working with middleware/web server: WebLogic (an asset), Websphere, JBoss, Tomcat\nProgramming experience with Oracle PL / SQL or MS SQL or SQL in general\nExperience with JavaScript, Java Swing, JQuery, BootStrap\nSolid experience in debugging and troubleshooting complex distributed systems.\nProven ability to write high-quality technical documentation\nA hands-on leader (able to code, able to dig deep)\n #INDCGIC"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=53110d5b52346ba6",
        "title": "Backend / Django Developer",
        "company": "Coulter Software Inc.",
        "content": "Coulter Software Inc. is a software consulting company. We develop custom software for our clients to support their business ventures and operations.\nOur goal is to provide the best web and mobile technology solutions we can to our clients so their businesses can grow and scale.\nWe are looking for a Python/Django developer with at least 3 years experience in a similar environment to join our team. Proven experience with Django is a must.\nAs a developer you will have exposure to multiple projects at a time. You must be a quick learner and grasp concepts easily. We work in small teams and that means you must be able to work well with others and have great communication skills.\nYour ability to come up with workable and valid solutions along with clear and concise code will be a key skill. Your problem solving skills must be honed and sharp.\nThere are always opportunities for continuously learning. We like to stay on top of our game!\nWe do team events when possible given the current situation.\nExperience Required:\n\nMinimum 3 years Python/Django development\nPrevious experience with NodeJS/Meteor/React as asset\nExperience with AWS or other cloud environment required\nCI/CD Experience required\nFast learner and capable of multi-tasking\nPrevious experience working in a team environment\n\nKey Responsibilities:\n\nworking with customers and other team members to understand and define requirements\ndeveloping clear and understandable code\ndeveloping automated tests\nworking with team members, knowledge sharing\n\nremote work until rules allow, then looking to return to a flex environment with some days in office and others remote.\nWork remotely\n\nTemporarily due to COVID-19\n\nJob Types: Full-time, Permanent\nSalary: $55,000.00-$80,000.00 per year\nBenefits:\n\nCasual dress\nCompany events\nDental care\nDisability insurance\nExtended health care\nLife insurance\nOn-site parking\nPaid time off\nVision care\n\nSchedule:\n\nMonday to Friday\n\nExperience:\n\nDjango: 3 years (required)\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=326298d2a27e5bba",
        "title": "Software Developer - Backend",
        "company": "Green Brick Labs",
        "content": "\nAs a Software Developer - Backend, you will work closely with solution designers to solve problems and challenges associated with high transactional, high availability financial services that are developed at GBL. You will also be working side by side with a feature team to turn these solutions into reality and ensure product functionality, performance, and availability are not impacted.\n\n You will work with Go, Vue.js, Docker, Kubernetes, and more on projects that leverage the power of microservices. You’ll design, develop, integrate, test, deploy, and maintain financial applications.\n\n We truly believe in the importance of a team. You will be a part of a collaborative environment where we learn together, grow together, and win together.\n\n About you\n\n You have a passion for programming and would like to explore creating cutting edge financial applications accepting cryptocurrencies! You have knowledge of blockchain or experience integrating with blockchain, preferably through direct or side projects. You're a critical thinker with a passion for solving complex problems alongside teammates. You enjoy quickly prototyping and spinning up new systems to take advantage of these fast changing opportunities in the cryptocurrency space.\n\n You’re energetic, and eager to bring your best ideas to the table. You take pride in your own work and accomplishments just as much as in the achievements of your team. You are honest, upfront and don’t take yourself too seriously. You understand the importance of delivering quality and speed for clients, and thrive on delivering success.\n\n About the tech\n\n We love open source, here are some of the tools and technologies we work with in GBL:\n\n\n Go / TypeScript / Vue.js\nPostgreSQL / MySQL\nRabbitMQ / Kafka\nDocker / Kubernetes\n\n\n\n Responsibilities\n\n\n Work with the cross functional teams (Product, Design, Devops & Customer support) to define high-level solutions to tech problems\nBackend development pertaining to the integration with blockchains (BTC, ETH, etc) and other 3rd party applications\nWrite tests for all your work, and participate in code reviews and business/technical discussions\nBe involved in the research, design, development, testing and documentation of new features and systems\nBrainstorm with solution designers and team members to evaluate applications for new tools and technologies\nFollow code management procedures for proper revision control\nRespond quickly to bugs which made it into production\nParticipate in the scrum development process\nShow off your successes at company-wide sprint demos\n\n\n\n Requirements\n\n\n Ability to develop software in VueJs / Golang or the desire to learn\nExperience working with Authentication and Authorization tools\nKnowledge of relational databases like MySQL, PostgreSQL\nExperience supporting a large application with multiple customers\nBasic understanding of Security, Data privacy & data protection\n\n\n\n Life @ GBL\n\n\n Four day work weeks. Four day work weeks. You read that correctly, true four day work weeks (Monday - Thursday)\nCompany shutdown between Christmas & New Years\nLearning and development - we focus on the growth of the team\nTrust - you can’t have great teams without this\nWeekly virtual social events to help promote team camaraderie\n\n\n\n We’re full of bright and diverse thinkers. GBL is committed to supporting inclusion, diversity and accessibility to all employees. We understand and know that diverse teams are strong teams. We are proud to operate as an equal opportunity employer. If you require accommodation during the application process, please let us know and we will provide a positive experience!\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=be16c8c70a287b04",
        "title": "software developer",
        "company": "Bachacha Associates Inc",
        "content": "\n\nEducation: College, CEGEP or other non-university certificate or diploma from a program of 1 year to 2 years\nExperience: 3 years to less than 5 years\nHealth benefits\n Dental plan\n Health care plan\n Vision care benefits\nWork Term: Permanent\nWork Language: English\nHours: 35 to 40 hours per week\n\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=5a0806287b578fb7",
        "title": "Junior Software Developer",
        "company": "Bioinformatics Solutions",
        "content": "\nJob Description\n Bioinformatics Solutions is looking for a junior level Software Developer (Java) to join our team building industry-leading proteomics software. You will be working with our development team to build next generation proteomic research and analysis software that can handle gigantic amounts of data and help our customers fulfil their research tasks more efficiently that can in turn make positive impacts to our lives.\n Responsibilities\n\nWork closely with other developers in an agile and collaborative environment to foster continuous improvement at the team and company level.\nShip and maintain complex Java applications at scale with the latest technologies.\nFollow best practices, write clean, well-organized, efficient, and reusable code.\n\nRequirements\n\nBS in computer science/engineering or related fields.\nDeep understanding in object-oriented design and implementation.\nDeep understanding in commonly used data structures and algorithms, and ability to apply them to solve complex problems.\nExperience and proficiency with a mainstream high level object-oriented programming language: Java or similar.\nStrong communication skills and ability to collaborate with team members efficiently.\nDesire to learn the latest technologies and apply them to improve your development practice.\n\nNice to Have\n\n1+ years of experience working on production and consumer facing Java applications.\nExperience with Akka Toolkit, reactive programming, or asynchronous programming.\nExperience working with SQL and NoSQL databases.\nMaster’s degree or above in computer science/engineering or related fields.\nKnowledge of bioinformatics for proteomics.\n\nApply Now\n Please send your resume to jobs@bioinfor.com. We will contact you if we wish to arrange an interview.\n We thank all applicants in advance for their interest in this position; however, only those selected for an interview will be contacted. For more information about BSI and the products and services we provide, please visit: www.bioinfor.com.\n\n\nWe are always looking to expand our sales and development teams, as well as on the lookout for talented people with other areas of expertise. If you are interested in joining our team, please send your resume to jobs@bioinfor.com. We will contact you if we wish to arrange an interview."
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=79c99ca08b611b8a",
        "title": "Back-end Software Engineer",
        "company": "Manulife",
        "content": "\nAre you looking for a supportive, collaborative workplace with great teams and inspiring leaders? You’ve come to the right place. We’re looking for ambitious people who share our values and want to make every day better for people around the world. If this sounds like you, and the career below sounds exciting, we’d like to hear from you. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWorking Arrangement \n\n\n\n\n\n\n\n\n\n\n\n\n\nAt Home \n \nJob Description \n\nManulife's proven track record as a trusted provider has uniquely positioned us to help our clients with their most critical life choices. And we don’t take that responsibility lightly. At Manulife, we are dedicated to making decisions easier and lives better. You’ll be joining Manulife at a pivotal moment as we are working hard to not only change ourselves, but our industry, too. \nAre you looking for a unique experience that combines industry leading technologies that integrate with a mainframe, then this role is for you! \n\nAs a Back-end Software Engineer, you will: \n\nBuild, code, test and maintain high quality software \nParticipates in Agile sprints and ceremonies; supports rapid iteration and development \nTranslates user requirements into software requirements \nResponsible for designing, developing, testing, maintaining, and improving applications, as a member of a team, works across key data, orchestration, rules and transactional stacks through the entire application and system development life cycle. \nBuilds code to specifications and standards \nBuilds and codes moderately sophisticated software \nContributes code at a BU level \nContributes to the success of a team as a mentor \nAnalyzes, codes, and tests software components as defined by the PO and team \nCreates and conducts executable tests, continuously integrating code into the overall software framework \nReviews current software framework to identify defects and opportunities to improve performance and stability \nCompletes and ensures completion of any required documentation required e.g. deployment, maintenance, support and business needs \nResearch technical strategies, third party tools, and current and new technologies to deal with emerging technical issues and improve development efficiency \nPromotes agile principles and methodology \nApplies focused coding practices to enable agility and delivery of high-quality code \nAbility to do impact analysis and propose high level system solutions for new developments \n\n\nRequirements for success: \n\nLanguages (Java, Javascript, C# .Net and/or JAVA ) \nAutomated Testing (Selenium, WebdriverIO, Mocha, Chai, Postman, and Jest) \nDevOps and APIs (Jenkins, Snyk, Pivotal Cloud Foundry, Azure, and SonarQub) \nCloud platform (AKS) \nJira for task management, GitHub for source control \nExperience with Automation technologies such as Jenkins and other open-source testing frameworks \nExperience with Agile practices and tools such as JIRA and Confluence \nUnderstanding of software development process \nFamiliar with platform technologies \nFamiliar with modern software architectures and API-driven development \nStaying abreast of developments in own technical discipline and able to recognize and translate these to own working environment \nWrites clear, readable and maintainable code, takes ownership of the quality and usability of code \nUnderstands systems development methodology \nStrong foundation in design, programming and testing in mainframe environments \nCollaborative demeanor, willingness to work with team members; able to coach, participate in code reviews, share skills and methods \nGood organizational and problem-solving abilities that enable you to manage through creative abrasion \nGood verbal and written communication; optimally articulates technical vision, possibilities, and outcomes \nBS in Computer Science preferred or equivalent professional experience \n\n\nWhat can we offer you? \n\nA competitive salary and benefits packages. \nA growth trajectory that extends upward and outward, encouraging you to follow your passions and learn new skills. \nA focus on growing your career path with us. \nFlexible work policies and strong work-life balance. \nProfessional development and leadership opportunities. \n\n Our commitment to you \n\nValues-first culture  We lead with our Values every day and bring them to life together. \nBoundless opportunity  We create opportunities to learn and grow at every stage of your career. \nContinuous innovation  We invite you to help redefine the future of financial services. \nDelivering the promise of Diversity, Equity and Inclusion  We foster an inclusive workplace where everyone thrives. \nChampioning Corporate Citizenship  We build a business that benefits all partners and has a positive social and environmental impact. \n\n\nEvery career at Manulife/John Hancock provides the opportunity to learn new skills and move your career forward. Ready to make an impact somewhere? What are you waiting for? Apply today. \n\nAbout John Hancock and Manulife \n\nJohn Hancock is a unit of Manulife Financial Corporation, a leading international financial services group that helps people make their decisions easier and lives better. We operate primarily as John Hancock in the United States, and Manulife globally, including Canada, Asia and Europe. We provide financial advice, insurance and wealth and asset management solutions for individuals, groups and institutions. Assets under management and administration by Manulife and its subsidiaries were CAD$1.3 trillion (US$1.1 trillion) as of June 30, 2021. Manulife Financial Corporation trades as MFC on the TSX, NYSE, and PSE, and under 945 on the SEHK. Manulife can be found at manulife.com . \n\nOne of the largest life insurers in the United States, John Hancock supports more than 10 million Americans with a broad range of financial products, including life insurance , annuities , investments , 401(k) plans , and education savings plans . Additional information about John Hancock may be found at johnhancock.com . \n\nManulife is an Equal Opportunity Employer \n\nAt Manulife /John Hancock , we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour , ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law. \n\nIt is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process . All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies . To request a reasonable accommodation in the application process, contact recruitment@manulife.com .\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=60208f206e3608d4",
        "title": "Software Quality Engineer",
        "company": "Manulife",
        "content": "\nAre you looking for a supportive, collaborative workplace with great teams and inspiring leaders? You’ve come to the right place. We’re looking for ambitious people who share our values and want to make every day better for people around the world. If this sounds like you, and the career below sounds exciting, we’d like to hear from you. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWorking Arrangement \n\n\n\n\n\n\n\n\n\n\n\n\n\nHybrid \n \nJob Description \n\nAs a Software Quality Engineer, you will : \n\nReview and translate requirements, specifications and technical design documents to provide meaningful feedback to product developers \nBuild, maintain and implement automated regression and performance test scripts using Selenium, X-ray, Postman & JMeter \nAnalyze automation results and investigate failures \nDesign detailed and comprehensive test plans and cases \nPerform manual functional and regression testing where automation is not applicable \nIdentify test KPIs for product quality and product reporting metrics \nTrack quality assurance metrics such as defect densities & defect frequency first time pass rate \nKeep up to date on the latest test software and frameworks \nDrive software development process to quality-centric methodologies \nIdentify Quality Assurance process bottlenecks and design and implement solutions \nControl, update and distribute new and revised quality standards and technical changes \nPrepare and deliver formal quality audit reports \n\nQualifications: \nYou will bring and continuously build upon the following skills: \n\nExperience in software quality assurance \nSophisticated level of expertise in test automation is a must \nExperience writing broad test plans and cases \nAbility to identify standard processes and where they should be applied (ex. risk-based testing) \nFamiliarity with black box and white box testing practices \nExpertise with testing / automation technologies such as: Selenium, Cucumber, X-ray, JIRA \nConfirmed knowledge of different testing techniques i.e. UI testing, automated testing, behavior driven testing \nCollaborative demeanor, willingness to work with team members; able to mentor, participate in code reviews, share skills and methods \nContinuously learn from both success and failure \nGood organizational and problem-solving abilities that enable you to lead through creative abrasion \nGood verbal and written communication; optimally articulate technical vision, possibilities, and outcomes \nExperiments with new technologies and understanding how they will affect what comes next \nDegree in computer science or technical field or equivalent practical experience \n5 or more years proven track record supporting all testing deliverables for sophisticated enterprise implementations \n\nWhat can we offer you? \n\nA competitive salary and benefits packages. \nA growth trajectory that extends upward and outward, encouraging you to follow your passions and learn new skills. \nA focus on growing your career path with us. \nFlexible work policies and strong work-life balance. \nProfessional development and leadership opportunities. \n\nOur dedication to you \n\nValues-first culture \nWe lead with our Values every day and bring them to life together. \nBoundless opportunity \nWe present opportunities to learn and grow at every stage of your career. \nContinuous innovation \nWe invite you to help redefine the future of financial services. \nDelivering the promise of Diversity, Equity and Inclusion \nWe foster an inclusive workplace where everyone thrives. \nChampioning Corporate Citizenship \nWe build a business that benefits all collaborators and has a positive social and environmental impact. \n\n\nEvery career at Manulife/John Hancock provides the opportunity to learn new skills and move your career forward. Ready to make an impact somewhere? What are you waiting for? Apply today. \n\nAbout John Hancock and Manulife \n\nJohn Hancock is a unit of Manulife Financial Corporation, a leading international financial services group that helps people make their decisions easier and lives better. We operate primarily as John Hancock in the United States, and Manulife globally, including Canada, Asia and Europe. We provide financial advice, insurance and wealth and asset management solutions for individuals, groups and institutions. Assets under management and administration by Manulife and its subsidiaries were CAD$1.3 trillion (US$1.1 trillion) as of June 30, 2021. Manulife Financial Corporation trades as MFC on the TSX, NYSE, and PSE, and under 945 on the SEHK. Manulife can be found at manulife.com . \n\nOne of the largest life insurers in the United States, John Hancock supports more than 10 million Americans with a broad range of financial products, including life insurance , annuities , investments , 401(k) plans , and education savings plans . Additional information about John Hancock may be found at johnhancock.com . \n\nManulife is an Equal Opportunity Employer \n\nAt Manulife /John Hancock , we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour , ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy-related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law. \n\nIt is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process . All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies . To request a reasonable accommodation in the application process, contact recruitment@manulife.com . \n\n\n\n\n\n\n\n\nSalary & Benefits \n\n\n\n\n\n\n\nThe annual base salary for this role in the primary location of Waterloo, Ontario is expected to be between $72,450.00 CAD - $134,550.00 CAD. \n \nIf you are applying for this role outside of the primary location, please contact recruitment@manulife.com for the salary range for your location. The actual salary will vary depending on local market conditions, geography and relevant job-related factors such as knowledge, skills, qualifications, experience, and education/training. Employees also have the opportunity to participate in incentive programs and earn incentive compensation tied to business and individual performance. \n\nManulife offers eligible employees a wide array of customizable benefits, including health, dental, mental health, vision, short- and long-term disability, life and AD&D insurance coverage, adoption/surrogacy and wellness benefits, and employee/family assistance plans. We also offer eligible employees various retirement savings plans (including pension and a global share ownership plan with employer matching contributions) and financial education and counseling resources. Our generous paid time off program in Canada includes holidays, vacation, personal, and sick days, and we offer the full range of statutory leaves of absence. If you are applying for this role in the U.S., please contact recruitment@manulife.com for more information about U.S.-specific paid time off provisions.\n"
    },
    {
        "url": "https://ca.indeed.com/viewjob?jk=59e0c8861ae07896",
        "title": "Web developer",
        "company": "CREATIVE MUSE MARKETING INC.",
        "content": "\n\nEducation: Bachelor's degree\nExperience: 1 year to less than 2 years\nor equivalent experience\n Tasks\n Consult with clients to develop and document Website requirements\n Source, select and organize information for inclusion and design the appearance, layout and flow of the Website\n Create and optimize content for Website using a variety of graphics, database, animation and other software\n Plan, design, write, modify, integrate and test Web-site related code\n Computer and technology knowledge\n JavaOS\n HTML\n Java\n JavaScript\n CSS\n PHP\n Website creation and management software\n Ajax\n Programming languages\n Computer-aided design (CAD)\n Ruby\n Python\nWork Term: Permanent\nWork Language: English\nHours: 35 to 40 hours per week\n\n"
    }
]